#### Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [1]:
import pandas as pd

In [2]:
Series1=pd.Series(data=[4,8,15,16,23,42])

In [3]:
Series1

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

#### Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
#### variable print it.

In [4]:
list1=[1,2,[34,"name"],"class",(36,65),{"age":33}]

In [5]:
list1

[1, 2, [34, 'name'], 'class', (36, 65), {'age': 33}]

In [6]:
series2=pd.Series(list1)

In [7]:
series2

0              1
1              2
2     [34, name]
3          class
4       (36, 65)
5    {'age': 33}
dtype: object

In [8]:
type(series2)

pandas.core.series.Series

#### Q3. Create a Pandas DataFrame that contains the following data:Then, print the DataFrame.

In [9]:
df1=pd.DataFrame({"Name":["Alice","Bob","Claire"],"Age":[25,30,27],"Gender":["Female","Male","Female"]})

In [10]:
df1

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

#### Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

In [11]:
### DataFrame has two dimensional in nature and handle structural data, Like Ecxel having multiple rows and columns.
#### It is most widely used in data manipulation. It has many method and function

In [12]:
#### Series is one dimensional labeled only capable of holding any datatypes

#### Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
#### you give an example of when you might use one of these functions?

###### pandas.head(), pandas.tail(), pandas.info(),pandas.read_csv(),pandas.isnull(),pandas.dropna()
###### these are the some of the function used for data manipulation

In [13]:
## From df1 datframe created above

In [14]:
df1.head(2) ## used to see top 2 rows

    Name  Age  Gender
0  Alice   25  Female
1    Bob   30    Male

#### Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [15]:
### All are mutable in nature

#### Q7. Create a DataFrame using multiple Series. Explain with an example.

In [16]:
s1=pd.Series(["Abhishek","Aniket","RAhul","Venkat"])

In [17]:
s1

0    Abhishek
1      Aniket
2       RAhul
3      Venkat
dtype: object

In [18]:
s2=pd.Series([33,34,35,32])

In [19]:
s2

0    33
1    34
2    35
3    32
dtype: int64

In [20]:
s3=pd.Series(["Married","Married","Married","Single"])

In [21]:
s3

0    Married
1    Married
2    Married
3     Single
dtype: object

In [22]:
df2=pd.concat([s1,s2,s3],axis=1)

In [23]:
df2

          0   1        2
0  Abhishek  33  Married
1    Aniket  34  Married
2     RAhul  35  Married
3    Venkat  32   Single

In [24]:
type(df2)

pandas.core.frame.DataFrame